{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "model_zoo/internlm-xcomposer2-vl-7b",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 256,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 256,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "attention.wo",
    "feed_forward.w2",
    "attention.wqkv",
    "feed_forward.w1",
    "feed_forward.w3"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}